app/controllers/articles_controller.rb

   def show
      @article = Article.find(params[:id])
      @article.increment!(:views)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "views" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["views", 1], ["updated_at", "2019-03-05 23:11:09.309882"], ["id", 12]]

   def create
      @article = Article.new(article_params)
      @article.author_id = current_user.id
      @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "fsd"], ["body", "sdf"], ["created_at", "2019-02-27 01:19:26.233638"], ["updated_at", "2019-02-27 01:19:26.233638"]]

   def update
      @article = Article.find(params[:id])
      @article.author_id = current_user.id
      @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "articles" SET "author_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["author_id", 2], ["updated_at", "2019-03-05 23:38:25.544859"], ["id", 15]]